coport-uni/ESP32S3WebMonitor/examples/smart_plug/sdkconfig.defaults
# 칩 타깃
CONFIG_IDF_TARGET="esp32s3"

# 16MB 플래시
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Octal PSRAM (BOX-3는 16MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# CPU 클럭 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# LVGL 내장 sprintf에서 %f 지원. 없으면 lv_label_set_text_fmt("%f", x)가 'f' literal로 출력됨.
# (LVGL 9에서 LV_MEM_CUSTOM/LV_MEMCPY_MEMSET_STD는 제거됨 — 힙은 esp_lvgl_port가 관리.)
CONFIG_LV_USE_FLOAT=y

# USB-Serial JTAG 콘솔
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
